{"Starting Sequence":["I'm Nick Teal. My life is always the same.","Wake up, go to class, come back, tickle my buns, League of Legends, go to sleep.","The same routine day after day.","But lately, things have been different.","I've started playing this game called Katawa Shoujo.","It's literally changed my life. It forced me to take a long, hard look at who I was, and who I had become.","And more importantly-it's given a new meaning to my life.","I have to find a blind cripple girl to profess my love to!","And there's no better day to do it than today.","For, today isn't just any ordinary day.","Today...is Thursday, January 12th. A day unlike any other.","Today... is the day I find my TRUE WAIFU!","...","But before I do that, I wonder what everyone else is doing..."],"Locations":{"The Apartment":{"People":["Shiny","Mark","Mikelsons","Emo"],"Links":["The Ave","Reddit"]},"The Ave":{"People":null,"Links":["The Apartment","Hawaiian Barbecue","Chipotle","Red Square"]},"Hawaiian Barbecue":{"People":["Hawaiian Barbecue Guy"],"Links":["The Ave"]},"Chipotle":{"People":["David","Martin","Derek"],"Links":["The Ave"]},"Red Square":{"People":null,"Links":["The Ave","The Quad"]},"The Quad":{"People":null,"Links":["Red Square","McMahon"]},"McMahon":{"People":null,"Links":["The Quad","10th Floor Cluster"]},"10th Floor Cluster":{"People":null,"Links":["McMahon","Jin's Room","David's Room"]},"Jin's Room":{"People":null,"Links":["10th Floor Cluster","Jin's Bed"]},"Jin's Bed":{"People":["Jin"],"Links":["Jin's Room"]},"David's Room":{"People":["David"],"Links":["10th Floor Cluster"]},"Reddit":{"People":["Some Post"],"Links":["The Apartment"]}},"People":{"Shiny":{"Dialogue":[["Shiny: Hey Nick, want to come to the toolshed with me?","Nick: You mean the track shed. For gloves.","Shiny: Yeah whatever -- so wanna?",{"Choice":[{"Response":["Yes"],"Dialogue":["Nick: I will follow you to the ends of the track shed","Shiny: How does Astroglide make you feel?","Nick: I think I'll change my mind"]},{"Response":["No"],"Dialogue":["Nick: No. I would rather tickle my buns alone","Nick: You're a sick freak"]},{"Response":["What, Do you think you're some kind of White Knight?"],"Dialogue":["Nick: What, Do you think you're some kind of White Knight?","Shiny: I JUST WANTED YOUR LOVE","Nick: Never gonna give you up!..."]}]},"Shiny: Whatever man. Your loss"],["Shiny: I, the maitre chef de la frying pan will be turning these sardines into something delicious.","Nick: Those look disgusting.","Shiny: Indeed, but you forget the magic ingredient. *pulls out the special hot sauce*","Shiny: Now we can't JUST add this stuff. You need to add this stuff with feeling. ","Shiny: In fact, it's not just feeling. You need to cook with PASSION.","Shiny: With intensity. With emotion. With the need to enjoy every day as if it were our last.","Shiny: I cook like how I strive to live.","*spoons half the jar out on the frying pan*","Shiny: So, want to try some?","Nick: I already ate."],["Shiny: So, how was it?","Nick: It was...so beautiful. Emi...Oh, Emi. You'll never leave my heart.","Shiny: Dude, I thought Emi was kinda dissapointing.","Shiny: You know what'll never leave my heart? Track shed.","Nick: Yeah, that was pretty awkward.","Shiny: You know what was the worst part? The guy's face the whole time.","Shiny: You could tell he was thinking just one thing the whole time.","Nick: What?","Shiny: I CAN FEEL HER POOP ON MY DICK","...","Nick: Let's never do this again."]]},"David":{"Dialogue":[["David: WAAAAAAAAAAAAAAAH BAWWW","Nick: What's wrong? Something happen!?!?","David: I FEEL TERRIBLE ABOUT HANAKO","Nick: I KNOW HOW YOU FEEL. I cried my soul away over Lilly","Nick: Actually, you know what? I can't agree with you","Nick: Hanako is just some character from a game, so you just need to get your head out of the gutter because she isn't real","Nick: That's the difference between you and me.","David: butts"],["David: I almost was gonna get you one of these for your birthday(http://www.nekomagic.com/?p=23095)","Nick: Well that would have been sweet. Instead you got jack shit. I am disappoint.","It dawns upon me now that I really wish I got a longboard. My friends ended up being cheap","And they just got me these chipotle gift cards(NOT LIKE I DON'T WANT).","But still. A crappy game cost no money, cause [money = value of gift] right?"]]},"Mark":{"Dialogue":[["*Somewhere above a wartorn Battlefield*","Nick: Hold her steady Mark, or else I can't aim!","Mark: I'm trying, but we took a rocket to the left propeller and she's banking sharp.","Be advised, you're about to crash into a mountain","Nick: I thought you said you could fly this thing.","El General Huehue^2 has died"],["Mikelsons: HEY MARK!","Mikelsons: WANNA FUCK?!","Mark: no","Mikelsons: :( ","...","Nick: Hey mark...","Mark: Yes?","Nick: You want to have our bi-monthly mutually consenting wrestle fight?","Mark: of course","Nick: I'll get the pillows!"]]},"Emo":{"Dialogue":[["Emo: Don't worry guys, I got this.","An ally has been slain.","Emo: Where the fuck was the team???"],["Emo: HOLD MAH DIIIIIIIIIIIIIIIICK","Nick: No, sorry Emo. I can't hold your dick.","...","...","...","Emo: BUTT PLUG"],["Nick: You should have seen that gank I had. It was great.","Emo: You know what else is great?","Nick: What?","Emo: Skarner.","Nick: I asked for that one.","Emo: You know what's even greater?","Nick: ...What?","Emo: A frozen heart."]]},"Mikelsons":{"Dialogue":[["It's the dark of night. Everything is silent, and everyone is asleep.","Or so you would believe. But a single light turns on in Mikelson's room.","Noone expected it. Nobody was prepared. But it came nonetheless, like a great firebell in the night.","*WUB*","*WUB**WUB*","*WUB**WUB**WUB*","HOW DID YOU EVER KNOW...I NEVER TOLD...I HAVE A CRUSH ON YOU","Nick: Goddam that's not even real music."],["Mikelsons: So I was there heating some mo'fucking toquitos...","Mikelsons: When suddenly Mordokaiser walked up to me and told me to give them all to him or els i report u HUEHUEHUE","Mikelsons: But then I was all like NO. You know why? Because I was fucking SKARNER that's who.","Mikelsons: Then I took off all my clothes and rubbed vaseline over my glorious naked body.","Mikelsons: And finally I got on the ground and pretended I was a slug. True story.","Nick: Cool story bro."]]},"Hawaiian Barbecue Guy":{"Dialogue":[["Hawaiian Barbecue Guy: Herro.","Nick: I'll take 70.","Hawaiian Barbecue Guy: Sank You.","Nick: Gotta get me some of that yellow crunchy stuff."]]},"Martin":{"Dialogue":[["Martin: Someone fill this in."]]},"Derek":{"Dialogue":[["Derek: Did you guys just hear a barking spider?"]]},"Some Post":{"Dialogue":[["Post you're favorite Saintvicious quotes....(Click reply to see more)","Come on, what's a couple of hundred bucks, honey? It's only anal.","Just press R and run at people... that's all you gotta do!","Dude, that dog is licking his asshole, he is so ready to play Maokai!","I probably shouldn't dive this, but fuck it let's do this thing. DOUBLE KILL","BITCHES LOVE JEWELRY AND CANDLES","We do the barons!"]]},"Professor":{"Dialogue":[["Professor: So if you take the cross product of the net torque vector keeping in mind the net displacement from BOTH friction and the electrical field...","Professor: ...and then cross multiply that with the static internal tension, convert the function to parametric polar coordinates...","Professor: ...and then correctly use the property of superposition to accurately reflect the free body diagram, everything should make sense.","Professor: That is, of course, unless you take the acceleration of gravity to be a negative.","Professor: Only retards do that."]]},"Jin":{"Dialogue":[["Jin: Gosh darnit Nick not there!","Nick: Zug Zug"]]}},"People List":["Shiny","David","Mark","Emo","Mikelsons","Hawaiian Barbecue Guy","Martin","Derek","Some Post","Professor","Jin"],"Location List":["The Apartment","The Ave","Hawaiian Barbecue","Chipotle","Red Square","The Quad","McMahon","10th Floor Cluster","Jin's Room","Jin's Bed","David's Room","Reddit"]}