{"Starting Sequence":["...","I'm Nick Teal. My life is pretty tame and boring.","I'm so bored and lonely, I spend my time hanging out with my virtual waifus Lilly and Lydia on the computer.","Thursday January 12.. What a boring and crap day. Like totally useless day of no significance","Like there literally isn't anything interesting today. Shit this sucks.","I guess I'll just go to class and tickle my buns like I always do...always the same routine day after day.","I wonder what everyone else is up to..."],"Locations":{"The Apartment":{"Description":"Our Apartment? Cool people only, NO GIRLS ALLOWED","People":["Shiny","Mark","Mikelsons","Emo"],"Links":["The Ave","Reddit","Skyrim"]},"The Ave":{"Description":"I know these streets better than I know myself...","People":["Shiny","Mark","Mikelsons","Emo","Derek"],"Links":["The Apartment","Hawaiian Barbecue","Chipotle","Red Square"]},"Hawaiian Barbecue":{"Description":"Is that Jin's father?!?","People":["Hawaiian Barbecue Guy"],"Links":["Chipotle","The Ave"]},"Chipotle":{"Description":"Home sweet Chipotle","People":["David","Martin","Derek"],"Links":["Hawaiian Barbecue","The Ave"]},"Red Square":{"Description":"I LOVE MORMONS","People":["Shiny","Mark","Mikelsons","Emo","David","Martin"],"Links":["The Ave","The Quad","Fountain","Physics Building"]},"The Quad":{"Description":"This isn't Loew Hall, that means no real classes happen here!","People":["Mikelsons","Emo","Mark"],"Links":["Red Square","McMahon"]},"McMahon":{"Description":"The home I never had..","People":["David","Martin"],"Links":["The Quad","10th Floor Cluster","CSE Building","IMA"]},"10th Floor Cluster":{"Description":"This place is so cool","People":["David","Martin"],"Links":["McMahon","Jin's Room","David's Room"]},"Jin's Room":{"Description":"It smells like fart in here","People":["Jin"],"Links":["10th Floor Cluster","Jin's Bed"]},"Jin's Bed":{"Description":"It smells like sex in here","People":["Jin"],"Links":["Jin's Room"]},"David's Room":{"Description":"I'm unsure what country I'm in when I'm in here","People":["David"],"Links":["10th Floor Cluster","Skyrim"]},"Fountain":{"Description":"Geese poop landmines","People":["Mikelsons","Emo","David","Martin","Shiny"],"Links":["Red Square","CSE Building","IMA","Physics Building"]},"Physics Building":{"Description":"Smells like midterm","People":["David","Martin","Shiny"],"Links":["Fountain","Red Square","Lecture Hall"]},"Lecture Hall":{"Description":"Smells like zzzzzzzz","People":["Professor"],"Links":["Physics Building"]},"CSE Building":{"Description":"NERD ALERT","People":["David","Martin","Shiny"],"Links":["Fountain","IMA","McMahon"]},"IMA":{"Description":"I own this place...","People":["Martin","Derek"],"Links":["Fountain","CSE Building","McMahon"]},"Reddit":{"Description":"My true love","People":["Some Post"],"Links":["The Apartment"]},"Skyrim":{"Description":"My second home","People":["Lydia","Lilly"],"Links":["The Apartment","David's Room"]}},"People":{"Shiny":{"Description":"The coolest of the cool, the 1337est of the 1338. Also the one who probably wrote the dialogue you read.","Love":{"Success":["Shiny: Hey, check out this cool new feature I added to my game!"],"Failure":["Shiny: Dude, you suck at this game. You can't even long jump!"],"Love":["Shiny: Nick. You. My game. You play it. Now. Make a level too, while you're at it."]},"Dialogue":[["Shiny: Hey Nick, want to come to the toolshed with me?","Nick: You mean the track shed. For gloves.","Shiny: Yeah whatever -- so wanna?","Nick: What, Do you think you're some kind of White Knight?","Shiny: I JUST WANTED YOUR LOVE","Nick: Never gonna give you up!...","Shiny: Whatever man. Your loss"],["Shiny: I, the maitre chef de la frying pan will be turning these sardines into something delicious.","Nick: Those look disgusting.","Shiny: Indeed, but you forget the magic ingredient. *pulls out the special hot sauce*","Shiny: Now we can't JUST add this stuff. You need to add this stuff with feeling. ","Shiny: In fact, it's not just feeling. You need to cook with PASSION.","Shiny: With intensity. With emotion. With the need to enjoy every day as if it were our last.","Shiny: I cook like how I strive to live.","*spoons half the jar out on the frying pan*","Shiny: So, want to try some?","Nick: I already ate."],["Shiny: So, how was it?","Nick: It was...so beautiful. Emi...Oh, Emi. You'll never leave my heart.","Shiny: Dude, I thought Emi was kinda dissapointing.","Shiny: You know what'll never leave my heart? Track shed.","Nick: Yeah, that was pretty awkward.","Shiny: You know what was the worst part? The guy's face the whole time.","Shiny: You could tell he was thinking just one thing the whole time.","Nick: What?","Shiny: I CAN FEEL HER POOP ON MY DICK","...","Nick: Let's never do this again."],["Shiny: Hey, I may have asked you this before but...","Shiny: Have you ever tried Spam Musubi before?","Nick: You ask this every time.","Shiny: That's because it's so good!","Nick: It's alright, I just don't like the seaweed.","Shiny: But that's the best part!"],["Shiny: FUCK","Nick: What?","Shiny: SHIT COCKS","Nick: This is a safe place...","Shiny: DOUBLE NIGGER TITS"]]},"David":{"Description":"The programmer of this game. Cannot into HTML tables.","Love":{"Success":["David: Nick, I'll definitely go Weast with you!","Nick: No, that definitely says East"],"Failure":["David: That's totally nasty. Well. I can guarantee that I've seen worst(most worse) BUT STILL."],"Love":["David: I want to hang you on my shelf like one of my anime figures."]},"Dialogue":[["David: WAAAAAAAAAAAAAAAH BAWWW","Nick: What's wrong? Something happen!?!?","David: I FEEL TERRIBLE ABOUT HANAKO","Nick: I KNOW HOW YOU FEEL. I cried my soul away over Lilly","Nick: Actually, you know what? I can't agree with you","Nick: Hanako is just some character from a game, so you just need to get your head out of the gutter because she isn't real","Nick: That's the difference between you and me.","David: butts"],["Nick: Don't you think we're lost?","David: Of course not, we've travelled exactly 9001 steps weast.","Nick: That says West!"],["David: I'm Ready! I'm Ready! I'm Ready!","Nick: No you're not. It needs to be at least THREE times as big!","Nick: What is this.. a center for ants!?","David: Auu oo errm","David: HE'S ABSOLUTELY RIGHT"],["David: I almost was gonna get you one of these for your birthday(http://www.nekomagic.com/?p=23095)","Nick: Well that would have been sweet. Instead you got jack shit. I am disappoint.","It dawns upon me now that I really wish I got a longboard. My friends ended up being cheap","And they just got me these chipotle gift cards(NOT LIKE I DON'T WANT).","But still. A crappy game cost no money, cause [money = value of gift] right?"]]},"Mark":{"Description":"Mark 'Lemon Rust' Sippel, four dee kay fan.","Love":{"Success":["Mark: That's...pretty cool."],"Failure":["Mark: That's heresy!"],"Love":["Mark: FOR THE EMPRAH"]},"Dialogue":[["*Somewhere above a wartorn Battlefield*","Nick: Hold her steady Mark, or else I can't aim!","Mark: I'm trying, but we took a rocket to the left propeller and she's banking sharp.","Be advised, you're about to crash into a mountain","Nick: I thought you said you could fly this thing.","El General Huehue^2 has died"],["Mark: So in magic, you have these lands that you tap. That's called mana.","Nick: Ok...","Mark: We both have 20 health points. If you tap a monster to attack me, I lose that amount.","Mark: Oh and, there's 2 of a certain item in that deck that will basically just screw me over.","Nick: You mean these two?","*Plays the sword*","Nick: Trololol"],["Mikelsons: HEY MARK!","Mikelsons: WANNA FUCK?!","Mark: no","Mikelsons: :( ","...","Nick: Hey mark...","Mark: Yes?","Nick: You want to have our bi-monthly mutually consenting wrestle fight?","Mark: of course","Nick: I'll get the pillows!"]]},"Emo":{"Description":"Emo-'outRAGEous'-licious, player of AD Carries, diver of towers, feeder of scrubs","Love":{"Success":["Emo: TO YOU! TO ME! BACK TO YOU! TO ME!"],"Failure":["Emo: That's ghey. G H E Y. No homo."],"Love":["Emo: Beth won't ever have to know about this..."]},"Dialogue":[["Emo: Don't worry guys, I got this.","An ally has been slain.","Emo: Where the fuck was the team???"],["Emo: HOLD MAH DIIIIIIIIIIIIIIIICK","Nick: No, sorry Emo. I can't hold your dick.","...","...","...","Emo: BUTT PLUG"],["Nick: You should have seen that gank I had. It was great.","Emo: You know what else is great?","Nick: What?","Emo: Skarner.","Nick: I asked for that one.","Emo: You know what's even greater?","Nick: ...What?","Emo: A frozen heart."],["Emo: JIMBO I'M GOING INNNNN","Nick: Goddam it emo.","*An ally has been slain*","*An enemy double kill!*","Emo: JIMBOOOOOOOOOOOOOO","Nick: Emo, you're retarded."]]},"Mikelsons":{"Description":"Started playing WoW again. That's all you need to know.","Love":{"Success":["Mikelsons: Why, yes my good sir."],"Failure":["Mikelsons: Maybe another time, my good sir."],"Love":["Mikelsons: My good sir, let's make this happen."]},"Dialogue":[["It's the dark of night. Everything is silent, and everyone is asleep.","Or so you would believe. But a single light turns on in Mikelson's room.","Noone expected it. Nobody was prepared. But it came nonetheless, like a great firebell in the night.","*WUB*","*WUB**WUB*","*WUB**WUB**WUB*","HOW DID YOU EVER KNOW...I NEVER TOLD...I HAVE A CRUSH ON YOU","Nick: Goddam dubstep's not even real music."],["Mikelsons: So I was there heating some mo'fucking toquitos...","Mikelsons: When suddenly Mordokaiser walked up to me and told me to give them all to him or els i report u HUEHUEHUE","Mikelsons: But then I was all like NO. You know why? Because I was fucking SKARNER that's who.","Mikelsons: Then I took off all my clothes and rubbed vaseline over my glorious naked body.","Mikelsons: And finally I got on the ground and pretended I was a slug. True story.","Nick: Cool story bro."],["Nick: Hey Mikelsons, what movie should we watch?","Mikelsons: BBBBAAAAAAWWWWWWWWWWWWWWWMMMMMMMMMMMMMMM","Nick: No.","Mikelsons: You are waiting for a train...","Nick: NO.","Nick: How about...Mega Pirhana? That cover looks awesome.","Mikelsons: BEEP BEEP I'M A JEEP"],["Mikelsons: So you know I started playing WoW again.","Nick: Yeah, I saw.","Mikelsons: It's actually pretty fun, you should try it some time.","Nick: No thanks.","Shiny: SOME NERDS GET CONFUSED AND THINK THEYRE PLAYING WORLD OF WARCRAFT","Shiny: WHEN THEY TRY PLAYING LEAGUE OF LOSERS","Shiny: BUT IT REALLY IT DOESNT MATTER","Shiny: THEYRE ACTUALLY JUST THE SAME GAME.","...","..."]]},"Hawaiian Barbecue Guy":{"Description":"I enjoy the 56 with this Man","Love":{"Success":["Guy: Would you like your chunky chicken stuff salty or spicy?"],"Failure":["Guy: I don't think you will be getting your egg today","Nick: Tenga Egg?"],"Love":["Guy: Keep that 56 going!","Nick: This beats Shiny any day"]},"Dialogue":[["Hawaiian Barbecue Guy: Herro.","Nick: I'll take a number 70.","Hawaiian Barbecue Guy: Sank You.","Nick: Gotta get me some of that yellow crunchy chicken."]]},"Martin":{"Description":"Martin EL FUERTE Reyes, CSE 14x Ta.","Love":{"Success":["Martin: Ooh well then"],"Failure":["Martin: Nope dude I don't roll that way"],"Love":["Martin: DEFINITELY WAS KIDDING -- It seems that I indeed roll that way"]},"Dialogue":[["Martin: Nick! Jin has gone missing and we have a presentation to give in 20 minutes!","Martin: This is like that thing that happened in AP Calc with Sarah.","Nick: It's my birthday today, why should I have to go on an epic saga again?","Martin: Good point.","Martin: I just realized I didn't check in Jin's room, so he's probably in there anyway."],["Martin: Here's your birthday present Nick.","Nick: Oh sweet man, thanks!","Nick: ...","Nick: ...","Nick: ...","Nick: What is this?","Martin: What do you mean? You asked for this!","Martin: It's a Tenga egg. I heard you were out of eggs at your apartment so I got the most expensive egg I could find.","Nick: Do you have any clue what this is?","Martin: It's a really expensive egg. Now that I see it in person, it doesn't look edible though.","Nick: This this isn't edible at all!","Martin: Well I guess you should throw it away then since it's of no use.","Martin: Sorry about that.","Nick: It's okay, I'll keep it and see if I ever find any use for it."]]},"Derek":{"Description":"Derek 'OH GOD MAKE THE VOICES STOP' Sams, he's Southern.","Love":{"Success":["Derek: ok"],"Failure":["Derek: no"],"Love":["Derek: Nick, will ya draw me like one of your french girls?"]},"Dialogue":[["Derek: Did you guys just hear a barking spider?"],["Derek: You should feel lucky for at least getting this game as a present, Nick.","Derek: You know what I got for my last birthday from my parents?","Nick: No, what?","Derek: Not getting beaten.","Nick: That sucks.","Derek: I have to sleep out in the hog shed."],["Derek: This line is WAY too long. Want to head over to A Burger Place?","Nick: Sure, I love that place!","Derek: Not as much as I do. I've been there 5 times in the last week.","Derek: Dem burgers man, dem burgers."]]},"Some Post":{"Description":"Le redditor. He's in it for the karma.","Love":{"Success":["Redditor: UPBOAT"],"Failure":["Redditor: DOWNVOTE"],"Love":["Redditor: UPBOAT UPBOAT UPBOAT THAT SHIT, BEST THREAD EVER"]},"Dialogue":[["Post you're favorite Saintvicious quotes....(Click reply to see more)","Come on, what's a couple of hundred bucks, honey? It's only anal.","Just press R and run at people... that's all you gotta do!","Dude, that dog is licking his asshole, he is so ready to play Maokai!","I probably shouldn't dive this, but fuck it let's do this thing. DOUBLE KILL","BITCHES LOVE JEWELRY AND CANDLES","We do the barons!"],["Hottest LoL Girls....(Click reply to see more)","Sivir. I had a huge thing for Xena Warrior Princess back when I was in 4th grade.","Soraka! I need a bitch that can heal me AND make me a sandwich.","It's all about dat Caitlyn. Dem legs, man.","I get wet every time I get a kill with Miss Fortune.","Katarina is mai waifu~~","Annie?"]]},"Professor":{"Description":"Physics professor.","Love":{"Success":["Professor: GOOD MORNING SON"],"Failure":["Professor: BAD MORNING SON"],"Love":["Professor: SON"]},"Dialogue":[["Professor: So if you take the cross product of the net torque vector keeping in mind the net displacement from BOTH friction and the electrical field...","Professor: ...and then cross multiply that with the static internal tension, convert the function to parametric polar coordinates...","Professor: ...and then correctly use the property of superposition to accurately reflect the free body diagram, everything should make sense.","Professor: That is, of course, unless you take the acceleration of gravity to be a negative.","Professor: Only retards do that."]]},"Jin":{"Description":"your roomate from last year","Love":{"Success":["Jin: yes"],"Failure":["Jin: Gosh Dangit"],"Love":["Jin: Gosh Nick!"]},"Dialogue":[["Jin: Nick, the most terrible thing happened to me today...","Nick: What's that, Jin?","Jin: Well...I...","Nick: Longcat, huh?","Jin: I THOUGHT IT WOULD HAVE BEEN FUNNY","Nick: Jin","Jin: what?","Nick: I was there.","Jin: ...","Nick: That was rough, buddy","Jin: NO ONE WILL WANT TO BE MY FRIEND NOW, AND I'LL NEVER GET A GIRLFRIEND"],["Jin: Hey Nick, remember that one time i farted in your...","Nick: What?","Jin: Nevermind."],["Jin: Remember when we first met? You let me into your pack the first day","Nick: Yeah, that was fun","Jin: You know what else was fun?","Nick: what?","Jin: orange pants lol"],["Jin: Gosh darnit Nick!!"],["Jin: Is it normal to have feelings for your professor?","Nick: Umm, I'm not really sure Jin, why do you ask?","Jin: Oh, no reason, you know, a friend just asked and I thought I'd ask you...","Jin: ...","Jin: Okay it's just that my O-Chem teacher is SO HAWT I can't contain it.","Nick: I'm slightly frightened so I'm just going to leave now..."],["Nick: Oh hey Jin, how's it going?","Jin: Hey Nick, not too bad. How about you?","Nick: Just got out of class and thought I'd stop by the cluster and see what's going on.","Nick: What have you been up to?","Jin: Oh I just held up a bank.","Nick: Haha, that's funny.","Jin: I'm dead serious.","Jin: And if you say anything I'll make sure you wake up missing a kidney.","Jin: But if you don't say anything, there's $10,000 in it for you.","Nick: I think I'm just going to leave now, I'm a little uncomfortable...","Jin: Oh just FYI before you go, I'll have someone monitoring your every movement.","Jin: So if you say anything, I WILL KNOW.","Nick: My life is over *begins sobbing uncontrollably*"],["Nick: Hey Jin, what's up?","Jin: *crying, inaudible response*","Nick: See ya Jin..."],["Jin: Hey Nick, how long is longcat?","...","...","*le awkward silence*","Nick: I don't know, you'd better ask some East Koreans about it."],["Jin: Hey Nick, remember how you got me to play StarCraft II?","Nick: Yeah, it was one of the first things we did together as roomates freshman year. You were pretty nooby back then.","Jin: 4 Gate?","Nick: Proxy Pylon.","Jin: RUSH COLOSSI?","Nick: 6 POOL!","Nick: HNNNNNGHHH"]]},"Lilly":{"Description":"Your anime waifu. Blonde haired, blue-eyed cripple girl perfection.","Love":{"Success":["Lilly: Won't you sit down for a cup of tea?"],"Failure":["Lilly: I bet you ran fast with Emi on purpose, didn't you?"],"Love":["Lilly: I'd look at you, if I could see. I'd speak to you, if I had a voice. I'd hug you, if I had arms. Hisao...(I mean Nick)...I love you. I will never leave your desktop."]},"Dialogue":[["Lilly: I used to be able to see...","Lilly: But then I took an arrow to the eye.","Lilly: That is, of course, just a joke.","Lilly: But you shouldn't joke about other's disabilites."],["Lilly: Have you ever heard of the Sky Rim-Job?","Lilly: I don't know what it is either.","Lilly: I'm quite curious about it myself. I've heard it's quite popular."],["Lilly: Would you help me into the bath?","Lilly: It's quite cold and I'm not quite faimiliar with this place.","Nick: It's bun tickling time.","Lilly: You know I can't see you right now...","Lilly: But I definitely heard that."]]},"Lydia":{"Description":"Your nord waifu. oo","Love":{"Success":["Lydia: I'll tank any mob for you!"],"Failure":["Lydia: Your performance and Skyrim's combat system have a lot in common."],"Love":["Lydia: Let's make some unkillable children!"]},"Dialogue":[["Lydia: Oh, my sweet Dohvakin, I would love to marry you so.","Lydia: Our quest is of such grave importance. But alas, I cannot. ","Nick: Not if I have anything to say about it.","*Enters in code into the console*","Lydia: What kind of sandwich would you desire, my love?"],["Lydia: My love, my champion, my sweet Dohvakin, I really wish you would stop giving me these tiny undergarments to wear.","Lydia: They are really quite inappropriate for this Skyrim weather!","*Enters in code into the console*","Lydia: I give up, Dohvakin. I do this for you.","Nick: So I now would like to tickle your buns if that is alright with you my fair lady."]]}},"Achievements":{"Happy Birthday Nick!":"You opened up the game. Now get out of my House.","Molested Jin":"You broke into Jin's bed","Socially Acceptable":"You've talked to everyone at least once.","Through The Portal":"Get to David's Room through Skyrim","Fried Rice":"Successfully romance the Hawaiian Barbecue guy. Maybe now you'll get something that's not the 70.","Waifu Status":"Successfully romance Lilly or Lydia.","Fatass":"Hit up Chipotle not enough times. Only Thirty","Le Me and the Gf":"Successfully romance Random Reddit Poster.","Office After-Hours":"Successfully romance the professor."},"Default Love Success":["I follow what you're getting at. You're pretty cute you know if I say so myself"],"Default Love Failure":["What the hell man, get away from me","Nick: I'm so sorry! I just wanted to tickle your buns!"],"People List":["Shiny","David","Mark","Emo","Mikelsons","Hawaiian Barbecue Guy","Martin","Derek","Some Post","Professor","Jin","Lilly","Lydia"],"Location List":["The Apartment","The Ave","Hawaiian Barbecue","Chipotle","Red Square","The Quad","McMahon","10th Floor Cluster","Jin's Room","Jin's Bed","David's Room","Fountain","Physics Building","Lecture Hall","CSE Building","IMA","Reddit","Skyrim"],"Achievement List":["Happy Birthday Nick!","Molested Jin","Socially Acceptable","Through The Portal","Fried Rice","Waifu Status","Fatass","Le Me and the Gf","Office After-Hours"]}